zup/ЗУП_бюджет/src/InformationRegisters/СвойстваНачисленийГосударственныхСлужащих/СвойстваНачисленийГосударственныхСлужащих.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваНачисленийГосударственныхСлужащих</name>
  <resources>
    <name>ЯвляетсяДенежнымСодержанием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтношениеКДенежномуСодержанию</name>
    <type>
      <types>EnumRef.ОтношениеНачисленийКДенежномуСодержанию</types>
    </type>
  </resources>
  <resources>
    <name>УчетПриРасчетеОтпуска</name>
    <type>
      <types>EnumRef.УчетНачисленийВСохраняемомДенежномСодержании</types>
    </type>
  </resources>
  <resources>
    <name>УчетПриРасчетеСохраняемогоДенежногоСодержания</name>
    <type>
      <types>EnumRef.УчетНачисленийВСохраняемомДенежномСодержании</types>
    </type>
  </resources>
  <resources>
    <name>УчетВКомпенсацииПриУвольнении</name>
    <type>
      <types>EnumRef.УчетНачисленийВСохраняемомДенежномСодержании</types>
    </type>
  </resources>
  <resources>
    <name>ЯвляетсяДенежнымДовольствием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтношениеКДенежномуДовольствию</name>
    <type>
      <types>EnumRef.ОтношениеНачисленийКДенежномуДовольствию</types>
    </type>
  </resources>
  <resources>
    <name>ВходитВРасчетПособияПоУходуЗаРебенкомВоеннослужащим</name>
    <type>
      <types>EnumRef.ПорядокВхожденияВРасчетПособияПоУходуЗаРебенкомВоеннослужащим</types>
    </type>
  </resources>
  <dimensions>
    <name>Начисление</name>
    <type>
      <types>ChartOfCalculationTypesRef.Начисления</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zup/ЗУП_бюджет/src/InformationRegisters/СвойстваНачисленийГосударственныхСлужащих/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПараметрыОбновленияИсточникаПодключаемыхХарактеристикЗарплатаКадры(ПараметрыОбновления) Экспорт
	
	ПараметрыОбновления.ИмяРегистра = "СвойстваНачисленийГосударственныхСлужащих";
	ПараметрыОбновления.ИдентификаторИсточника = "ГосСлужба";
	ПараметрыОбновления.ИмяОбъекта = "Начисление";
	ПараметрыОбновления.ИмяПланаВидовХарактеристик = ПланыВидовРасчета.Начисления.ИмяПланаВидовПодключаемыхХарактеристикЗарплатаКадры();

	НастройкиПрограммы = ЗарплатаКадрыРасширенный.НастройкиПрограммыБюджетногоУчреждения();
	Если НастройкиПрограммы.ИспользоватьГосударственнуюСлужбу Тогда
		ПараметрыОбновления.Реквизиты.Добавить("ЯвляетсяДенежнымСодержанием");
		ПараметрыОбновления.Реквизиты.Добавить("ОтношениеКДенежномуСодержанию");
	КонецЕсли;
	
	Если НастройкиПрограммы.ИспользоватьМуниципальнуюСлужбу Тогда
		ПараметрыОбновления.Реквизиты.Добавить("ЯвляетсяДенежнымСодержанием");
		ПараметрыОбновления.Реквизиты.Добавить("ОтношениеКДенежномуСодержанию");
	КонецЕсли;
	
	Если НастройкиПрограммы.ИспользоватьРасчетСохраняемогоДенежногоСодержания Тогда
		ПараметрыОбновления.Реквизиты.Добавить("УчетПриРасчетеОтпуска");
		ПараметрыОбновления.Реквизиты.Добавить("УчетПриРасчетеСохраняемогоДенежногоСодержания");
		ПараметрыОбновления.Реквизиты.Добавить("УчетВКомпенсацииПриУвольнении");
	КонецЕсли;
	
	Если НастройкиПрограммы.ИспользоватьВоеннуюСлужбу Тогда
		ПараметрыОбновления.Реквизиты.Добавить("ЯвляетсяДенежнымДовольствием");
		ПараметрыОбновления.Реквизиты.Добавить("ОтношениеКДенежномуДовольствию");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СвернутьМассив(ПараметрыОбновления.Реквизиты);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
